/* Error message shown if an invalid statement syntax was used. */
"InvalidStatement" = "Invalid statement. Can’t do.";

/* Error message shown if an unknown pseudo class was used. */
"InvalidPseudoClass" = "Unknown pseudo class. Typo?";

/* Error message shown if a statement misses an required expression. */
"UnmatchedExpression" = "Missing required expression.";

/* Error message shown if an identifier is expected inside a statement. */
"UnmatchedIdentifier" = "Missing identifier.";

/* Error message shown if a statement was not terminated (expected is a line break or a ';'). */
"UnmatchedEndStatement" = "Expecting line break or ';'.";

/* Error message shown if a style selector or mixin definition is not followed by a style definition. */
"UnmatchedStyleDefinition" = "Missing style definition.";

/* Error message shown if a setting identifier is not followed by a ":" inside a style definition. */
"UnmatchedStyleSepearator" = "Missing ':' after setting identifier.";

/* Error message shown if a multiplicative expression is expected. */
"UnmatchedMultiplicativeExpression" = "Missing required expression.";

/* Error message shown if an array expression should be terminated by ]. */
"Missing:]" = "Expecting ']' in array definition.";

/* Error message shown if the terminating brace '}' of a style is missing. */
"Missing:}" = "Expecting '}' in a style definition.";

/* Error message shown if an integer color component is missed in a RGB color. */
"UnmatchedIntColor" = "Expecting color value (0-255).";

/* Error message shown if a color component is not using a valid hexadecimal value. */
"UnmatchedHexColor" = "Expecting hexadecimal color value (#00 - #FF).";

/* Error message shown if an unknown style class is used inside a Ulysses style sheet. Placeholder contains the unknown class identifier. */
"UnknownNodeType" = "Unknown style class: %@";
